In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
note = """
    index = rows => moi row nhu 1 object co 4 attrs W, X, Y, Z
    columns = moi 1 column la list[attrs]
    
    update: df['NEW'] = [3,2,15,20,5]
    df['NEW'] = df['Y'] + df['Z']
    
"""

index = 'nhut dung thong tan hanh'.split()
columns = 'age sex job city'.split()

data = np.random.randint(1,10,(5,4))
df = pd.DataFrame(data,index=index,columns=columns)

In [4]:
df

       age  sex  job  city
nhut     2    7    8     9
dung     5    9    6     1
thong    6    9    2     4
tan      9    4    4     3
hanh     9    4    8     1

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [5]:
df['age']

nhut     2
dung     5
thong    6
tan      9
hanh     9
Name: age, dtype: int64

In [6]:
# Pass a list of column names
df[['age','job']] # selecting 2 columns

       age  job
nhut     2    8
dung     5    6
thong    6    2
tan      9    4
hanh     9    8

In [7]:
# SQL Syntax (NOT RECOMMENDED!)
df.sex

nhut     7
dung     9
thong    9
tan      4
hanh     4
Name: sex, dtype: int64

DataFrame Columns are just Series

In [8]:
type(df['age'])

pandas.core.series.Series

**Creating a new column:**

In [9]:
df['new'] = df['age'] + df['job']

In [10]:
df

       age  sex  job  city  new
nhut     2    7    8     9   10
dung     5    9    6     1   11
thong    6    9    2     4    8
tan      9    4    4     3   13
hanh     9    4    8     1   17

In [11]:
df.drop('new',axis=1) #Removing Columns axis=1 return new_dataframe

       age  sex  job  city
nhut     2    7    8     9
dung     5    9    6     1
thong    6    9    2     4
tan      9    4    4     3
hanh     9    4    8     1

In [12]:
# Not inplace unless specified!
df

       age  sex  job  city  new
nhut     2    7    8     9   10
dung     5    9    6     1   11
thong    6    9    2     4    8
tan      9    4    4     3   13
hanh     9    4    8     1   17

In [13]:
df.drop('new',axis=1,inplace=True) # remove <col new > inplace=True update df

In [14]:
df

       age  sex  job  city
nhut     2    7    8     9
dung     5    9    6     1
thong    6    9    2     4
tan      9    4    4     3
hanh     9    4    8     1

Can also drop rows this way:

In [15]:
df.drop('hanh',axis=0)

       age  sex  job  city
nhut     2    7    8     9
dung     5    9    6     1
thong    6    9    2     4
tan      9    4    4     3

In [16]:
df.loc['dung'] #Selecting Rows theo key

age     5
sex     9
job     6
city    1
Name: dung, dtype: int64

Or select based off of position instead of label

In [17]:
df.iloc[2] #Selecting Rows theo index = obj C

age     6
sex     9
job     2
city    4
Name: thong, dtype: int64

** Selecting subset of rows and columns **

In [18]:
df

       age  sex  job  city
nhut     2    7    8     9
dung     5    9    6     1
thong    6    9    2     4
tan      9    4    4     3
hanh     9    4    8     1

In [19]:
df.loc['thong','age'] # obj thong co attr age=6

6

In [20]:
df.loc['thong'].loc['age']

6

In [21]:
df.loc[['thong','dung'],['age','sex']] #

       age  sex
thong    6    9
dung     5    9

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [22]:
df

       age  sex  job  city
nhut     2    7    8     9
dung     5    9    6     1
thong    6    9    2     4
tan      9    4    4     3
hanh     9    4    8     1

In [23]:
df>0

        age   sex   job  city
nhut   True  True  True  True
dung   True  True  True  True
thong  True  True  True  True
tan    True  True  True  True
hanh   True  True  True  True

In [24]:
df[df>0]

       age  sex  job  city
nhut     2    7    8     9
dung     5    9    6     1
thong    6    9    2     4
tan      9    4    4     3
hanh     9    4    8     1

In [25]:
df[df['age']>0]

       age  sex  job  city
nhut     2    7    8     9
dung     5    9    6     1
thong    6    9    2     4
tan      9    4    4     3
hanh     9    4    8     1

In [26]:
df[df['age']>0]['sex']

nhut     7
dung     9
thong    9
tan      4
hanh     4
Name: sex, dtype: int64

In [27]:
df[df['age']>0][['sex','job']]

       sex  job
nhut     7    8
dung     9    6
thong    9    2
tan      4    4
hanh     4    8

For two conditions you can use | and & with parenthesis:

In [28]:
df[(df['age']>0) & (df['sex'] > 1)]

       age  sex  job  city
nhut     2    7    8     9
dung     5    9    6     1
thong    6    9    2     4
tan      9    4    4     3
hanh     9    4    8     1

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [29]:
df

       age  sex  job  city
nhut     2    7    8     9
dung     5    9    6     1
thong    6    9    2     4
tan      9    4    4     3
hanh     9    4    8     1

In [30]:
# Reset to default 0,1...n index
df.reset_index()

   index  age  sex  job  city
0   nhut    2    7    8     9
1   dung    5    9    6     1
2  thong    6    9    2     4
3    tan    9    4    4     3
4   hanh    9    4    8     1

In [31]:
newind = 'CA NY WY OR CO'.split()

In [32]:
df['States'] = newind

In [33]:
df

       age  sex  job  city States
nhut     2    7    8     9     CA
dung     5    9    6     1     NY
thong    6    9    2     4     WY
tan      9    4    4     3     OR
hanh     9    4    8     1     CO

In [34]:
df.set_index('States')

        age  sex  job  city
States
CA        2    7    8     9
NY        5    9    6     1
WY        6    9    2     4
OR        9    4    4     3
CO        9    4    8     1

In [35]:
df

       age  sex  job  city States
nhut     2    7    8     9     CA
dung     5    9    6     1     NY
thong    6    9    2     4     WY
tan      9    4    4     3     OR
hanh     9    4    8     1     CO

In [36]:
df.set_index('States',inplace=True) # updated

In [37]:
df

        age  sex  job  city
States
CA        2    7    8     9
NY        5    9    6     1
WY        6    9    2     4
OR        9    4    4     3
CO        9    4    8     1

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [38]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = 'dung thong phong dung thong phong'.split()
group_tuple = list(zip(outside,inside))
group_index = pd.MultiIndex.from_tuples(group_tuple)

In [39]:
group_index

MultiIndex([('G1',  'dung'),
            ('G1', 'thong'),
            ('G1', 'phong'),
            ('G2',  'dung'),
            ('G2', 'thong'),
            ('G2', 'phong')],
           )

In [40]:
df = pd.DataFrame(np.random.randn(6,2),index=group_index,columns=['age','sex'])
df

               age       sex
G1 dung   1.279975 -0.170430
   thong  0.308047 -1.061808
   phong -1.331713  2.084437
G2 dung   1.753258 -0.060464
   thong  0.707670 -1.084355
   phong  0.941276  1.301172

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [41]:
df.loc['G1']

            age       sex
dung   1.279975 -0.170430
thong  0.308047 -1.061808
phong -1.331713  2.084437

In [42]:
df.loc['G1'].loc['thong']

age    0.308047
sex   -1.061808
Name: thong, dtype: float64

In [43]:
df.index.names

FrozenList([None, None])

In [44]:
df.index.names = ['Group','objs'] # set names cho index=objecs columns=attrs

In [45]:
df

                  age       sex
Group objs
G1    dung   1.279975 -0.170430
      thong  0.308047 -1.061808
      phong -1.331713  2.084437
G2    dung   1.753258 -0.060464
      thong  0.707670 -1.084355
      phong  0.941276  1.301172

In [46]:
df.xs('G1')

            age       sex
objs
dung   1.279975 -0.170430
thong  0.308047 -1.061808
phong -1.331713  2.084437

In [47]:
df.xs(['G1','thong'])

age    0.308047
sex   -1.061808
Name: (G1, thong), dtype: float64

In [48]:
df.xs('thong',level='objs')

            age       sex
Group
G1     0.308047 -1.061808
G2     0.707670 -1.084355